keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  1F4, Watch Dog Timer Register */
#define PSI5_CH3_WDT1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F4u)

/** Alias (User Manual Name) for PSI5_CH3_WDT1.
* To use register names with standard convension, please use PSI5_CH3_WDT1.
*/
#define	PSI5_WDT31	(PSI5_CH3_WDT1)

/** \\brief  1F8, Watch Dog Timer Register */
#define PSI5_CH3_WDT2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051F8u)

/** Alias (User Manual Name) for PSI5_CH3_WDT2.
* To use register names with standard convension, please use PSI5_CH3_WDT2.
*/
#define	PSI5_WDT32	(PSI5_CH3_WDT2)

/** \\brief  1FC, Watch Dog Timer Register */
#define PSI5_CH3_WDT3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF00051FCu)

/** Alias (User Manual Name) for PSI5_CH3_WDT3.
* To use register names with standard convension, please use PSI5_CH3_WDT3.
*/
#define	PSI5_WDT33	(PSI5_CH3_WDT3)

/** \\brief  200, Watch Dog Timer Register */
#define PSI5_CH3_WDT4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005200u)

/** Alias (User Manual Name) for PSI5_CH3_WDT4.
* To use register names with standard convension, please use PSI5_CH3_WDT4.
*/
#define	PSI5_WDT34	(PSI5_CH3_WDT4)

/** \\brief  204, Watch Dog Timer Register */
#define PSI5_CH3_WDT5 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005204u)

/** Alias (User Manual Name) for PSI5_CH3_WDT5.
* To use register names with standard convension, please use PSI5_CH3_WDT5.
*/
#define	PSI5_WDT35	(PSI5_CH3_WDT5)

/** \\brief  208, Watch Dog Timer Register */
#define PSI5_CH3_WDT6 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_WDT*)0xF0005208u)

/** Alias (User Manual Name) for PSI5_CH3_WDT6.
* To use register names with standard convension, please use PSI5_CH3_WDT6.
*/
#define	PSI5_WDT36	(PSI5_CH3_WDT6)

/** \\brief  2CC, Channel Trigger Value Register */
#define PSI5_CH4_CTV /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF00052CCu)

/** Alias (User Manual Name) for PSI5_CH4_CTV.
* To use register names with standard convension, please use PSI5_CH4_CTV.
*/
#define	PSI5_CTV4	(PSI5_CH4_CTV)

/** \\brief  270, Input and Output Control Register */
#define PSI5_CH4_IOCR /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_IOCR*)0xF0005270u)

/** Alias (User Manual Name) for PSI5_CH4_IOCR.
* To use register names with standard convension, please use PSI5_CH4_IOCR.
*/
#define	PSI5_IOCR4	(PSI5_CH4_IOCR)

/** \\brief  2C8, Pulse Generation Control Register */
#define PSI5_CH4_PGC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF00052C8u)

/** Alias (User Manual Name) for PSI5_CH4_PGC.
* To use register names with standard convension, please use PSI5_CH4_PGC.
*/
#define	PSI5_PGC4	(PSI5_CH4_PGC)

/** \\brief  274, Receiver Control Register A */
#define PSI5_CH4_RCRA /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RCRA*)0xF0005274u)

/** Alias (User Manual Name) for PSI5_CH4_RCRA.
* To use register names with standard convension, please use PSI5_CH4_RCRA.
*/
#define	PSI5_RCRA4	(PSI5_CH4_RCRA)

/** \\brief  278, Receiver Control Register B */
#define PSI5_CH4_RCRB /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RCRB*)0xF0005278u)

/** Alias (User Manual Name) for PSI5_CH4_RCRB.
* To use register names with standard convension, please use PSI5_CH4_RCRB.
*/
#define	PSI5_RCRB4	(PSI5_CH4_RCRB)

/** \\brief  27C, Receiver Control Register C */
#define PSI5_CH4_RCRC /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RCRC*)0xF000527Cu)

/** Alias (User Manual Name) for PSI5_CH4_RCRC.
* To use register names with standard convension, please use PSI5_CH4_RCRC.
*/
#define	PSI5_RCRC4	(PSI5_CH4_RCRC)

/** \\brief  2C4, Receive Data Register High */
#define PSI5_CH4_RDRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF00052C4u)

/** Alias (User Manual Name) for PSI5_CH4_RDRH.
* To use register names with standard convension, please use PSI5_CH4_RDRH.
*/
#define	PSI5_RDRH4	(PSI5_CH4_RDRH)

/** \\brief  2C0, Receive Data Register Low */
#define PSI5_CH4_RDRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF00052C0u)

/** Alias (User Manual Name) for PSI5_CH4_RDRL.
* To use register names with standard convension, please use PSI5_CH4_RDRL.
*/
#define	PSI5_RDRL4	(PSI5_CH4_RDRL)

/** \\brief  29C, Receive Status Register */
#define PSI5_CH4_RSR /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_RSR*)0xF000529Cu)

/** Alias (User Manual Name) for PSI5_CH4_RSR.
* To use register names with standard convension, please use PSI5_CH4_RSR.
*/
#define	PSI5_RSR4	(PSI5_CH4_RSR)

/** \\brief  2D0, Send Control Register */
#define PSI5_CH4_SCR /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF00052D0u)

/** Alias (User Manual Name) for PSI5_CH4_SCR.
* To use register names with standard convension, please use PSI5_CH4_SCR.
*/
#define	PSI5_SCR4	(PSI5_CH4_SCR)

/** \\brief  2D8, Send Data Register High */
#define PSI5_CH4_SDRH /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF00052D8u)

/** Alias (User Manual Name) for PSI5_CH4_SDRH.
* To use register names with standard convension, please use PSI5_CH4_SDRH.
*/
#define	PSI5_SDRH4	(PSI5_CH4_SDRH)

/** \\brief  2D4, Send Data Register Low */
#define PSI5_CH4_SDRL /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF00052D4u)

/** Alias (User Manual Name) for PSI5_CH4_SDRL.
* To use register names with standard convension, please use PSI5_CH4_SDRL.
*/
#define	PSI5_SDRL4	(PSI5_CH4_SDRL)

/** \\brief  2A0, Serial Data and Status Register */
#define PSI5_CH4_SDS0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00052A0u)

/** Alias (User Manual Name) for PSI5_CH4_SDS0.
* To use register names with standard convension, please use PSI5_CH4_SDS0.
*/
#define	PSI5_SDS40	(PSI5_CH4_SDS0)

/** \\brief  2A4, Serial Data and Status Register */
#define PSI5_CH4_SDS1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00052A4u)

/** Alias (User Manual Name) for PSI5_CH4_SDS1.
* To use register names with standard convension, please use PSI5_CH4_SDS1.
*/
#define	PSI5_SDS41	(PSI5_CH4_SDS1)

/** \\brief  2A8, Serial Data and Status Register */
#define PSI5_CH4_SDS2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00052A8u)

/** Alias (User Manual Name) for PSI5_CH4_SDS2.
* To use register names with standard convension, please use PSI5_CH4_SDS2.
*/
#define	PSI5_SDS42	(PSI5_CH4_SDS2)

/** \\brief  2AC, Serial Data and Status Register */
#define PSI5_CH4_SDS3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00052ACu)

/** Alias (User Manual Name) for PSI5_CH4_SDS3.
* To use register names with standard convension, please use PSI5_CH4_SDS3.
*/
#define	PSI5_SDS43	(PSI5_CH4_SDS3)

/** \\brief  2B0, Serial Data and Status Register */
#define PSI5_CH4_SDS4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF00052B0u)

