keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  330, Interrupt Status Register B */
#define PSI5_INTSTATB3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005330u)

/** \\brief  334, Interrupt Status Register B */
#define PSI5_INTSTATB4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005334u)

/** \\brief  3D8, Kernel Reset Register 0 */
#define PSI5_KRST0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRST0*)0xF00053D8u)

/** \\brief  3DC, Kernel Reset Register 1 */
#define PSI5_KRST1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRST1*)0xF00053DCu)

/** \\brief  3E0, Kernel Reset Status Clear Register */
#define PSI5_KRSTCLR /*lint --e(923)*/ (*(volatile Ifx_PSI5_KRSTCLR*)0xF00053E0u)

/** \\brief  5D8, MEIOV Clear Register */
#define PSI5_MEICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055D8u)

/** \\brief  5DC, MEIOV Clear Register */
#define PSI5_MEICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055DCu)

/** \\brief  5E0, MEIOV Clear Register */
#define PSI5_MEICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E0u)

/** \\brief  5E4, MEIOV Clear Register */
#define PSI5_MEICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E4u)

/** \\brief  5E8, MEIOV Clear Register */
#define PSI5_MEICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEICLR*)0xF00055E8u)

/** \\brief  498, MEI Overview Register */
#define PSI5_MEIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF0005498u)

/** \\brief  49C, MEI Overview Register */
#define PSI5_MEIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF000549Cu)

/** \\brief  4A0, MEI Overview Register */
#define PSI5_MEIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A0u)

/** \\brief  4A4, MEI Overview Register */
#define PSI5_MEIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A4u)

/** \\brief  4A8, MEI Overview Register */
#define PSI5_MEIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A8u)

/** \\brief  538, MEIOV Set Register */
#define PSI5_MEISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005538u)

/** \\brief  53C, MEIOV Set Register */
#define PSI5_MEISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF000553Cu)

/** \\brief  540, MEIOV Set Register */
#define PSI5_MEISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005540u)

/** \\brief  544, MEIOV Set Register */
#define PSI5_MEISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005544u)

/** \\brief  548, MEIOV Set Register */
#define PSI5_MEISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_MEISET*)0xF0005548u)

/** \\brief  574, NBIOV Clear Register */
#define PSI5_NBICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005574u)

/** \\brief  578, NBIOV Clear Register */
#define PSI5_NBICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005578u)

/** \\brief  57C, NBIOV Clear Register */
#define PSI5_NBICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF000557Cu)

/** \\brief  580, NBIOV Clear Register */
#define PSI5_NBICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005580u)

/** \\brief  584, NBIOV Clear Register */
#define PSI5_NBICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBICLR*)0xF0005584u)

/** \\brief  434, NBI Overview Register */
#define PSI5_NBIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005434u)

/** \\brief  438, NBI Overview Register */
#define PSI5_NBIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005438u)

/** \\brief  43C, NBI Overview Register */
#define PSI5_NBIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF000543Cu)

/** \\brief  440, NBI Overview Register */
#define PSI5_NBIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005440u)

/** \\brief  444, NBI Overview Register */
#define PSI5_NBIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005444u)

/** \\brief  4D4, NBIOV Set Register */
#define PSI5_NBISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D4u)

/** \\brief  4D8, NBIOV Set Register */
#define PSI5_NBISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D8u)

/** \\brief  4DC, NBIOV Set Register */
#define PSI5_NBISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054DCu)

/** \\brief  4E0, NBIOV Set Register */
#define PSI5_NBISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054E0u)

/** \\brief  4E4, NBIOV Set Register */
#define PSI5_NBISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054E4u)

/** \\brief  5C4, NFIOV Clear Register */
#define PSI5_NFICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C4u)

/** \\brief  5C8, NFIOV Clear Register */
#define PSI5_NFICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055C8u)

/** \\brief  5CC, NFIOV Clear Register */
#define PSI5_NFICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055CCu)

/** \\brief  5D0, NFIOV Clear Register */
#define PSI5_NFICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055D0u)

/** \\brief  5D4, NFIOV Clear Register */
#define PSI5_NFICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFICLR*)0xF00055D4u)

/** \\brief  484, NFI Overview Register */
#define PSI5_NFIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005484u)

/** \\brief  488, NFI Overview Register */
#define PSI5_NFIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005488u)

/** \\brief  48C, NFI Overview Register */
#define PSI5_NFIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF000548Cu)

/** \\brief  490, NFI Overview Register */
#define PSI5_NFIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005490u)

/** \\brief  494, NFI Overview Register */
#define PSI5_NFIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005494u)

/** \\brief  524, NFIOV Set Register */
#define PSI5_NFISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005524u)

/** \\brief  528, NFIOV Set Register */
#define PSI5_NFISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005528u)

/** \\brief  52C, NFIOV Set Register */
#define PSI5_NFISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF000552Cu)

/** \\brief  530, NFIOV Set Register */
#define PSI5_NFISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_NFISET*)0xF0005530u)

