keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  96C, Receive Data Memory High */
#define PSI5_RDM3_13_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000596Cu)

/** Alias (User Manual Name) for PSI5_RDM3_13_H.
* To use register names with standard convension, please use PSI5_RDM3_13_H.
*/
#define	PSI5_RDMH313	(PSI5_RDM3_13_H)

/** \\brief  968, Receive Data Memory Low */
#define PSI5_RDM3_13_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005968u)

/** Alias (User Manual Name) for PSI5_RDM3_13_L.
* To use register names with standard convension, please use PSI5_RDM3_13_L.
*/
#define	PSI5_RDML313	(PSI5_RDM3_13_L)

/** \\brief  974, Receive Data Memory High */
#define PSI5_RDM3_14_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005974u)

/** Alias (User Manual Name) for PSI5_RDM3_14_H.
* To use register names with standard convension, please use PSI5_RDM3_14_H.
*/
#define	PSI5_RDMH314	(PSI5_RDM3_14_H)

/** \\brief  970, Receive Data Memory Low */
#define PSI5_RDM3_14_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005970u)

/** Alias (User Manual Name) for PSI5_RDM3_14_L.
* To use register names with standard convension, please use PSI5_RDM3_14_L.
*/
#define	PSI5_RDML314	(PSI5_RDM3_14_L)

/** \\brief  97C, Receive Data Memory High */
#define PSI5_RDM3_15_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000597Cu)

/** Alias (User Manual Name) for PSI5_RDM3_15_H.
* To use register names with standard convension, please use PSI5_RDM3_15_H.
*/
#define	PSI5_RDMH315	(PSI5_RDM3_15_H)

/** \\brief  978, Receive Data Memory Low */
#define PSI5_RDM3_15_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005978u)

/** Alias (User Manual Name) for PSI5_RDM3_15_L.
* To use register names with standard convension, please use PSI5_RDM3_15_L.
*/
#define	PSI5_RDML315	(PSI5_RDM3_15_L)

/** \\brief  984, Receive Data Memory High */
#define PSI5_RDM3_16_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005984u)

/** Alias (User Manual Name) for PSI5_RDM3_16_H.
* To use register names with standard convension, please use PSI5_RDM3_16_H.
*/
#define	PSI5_RDMH316	(PSI5_RDM3_16_H)

/** \\brief  980, Receive Data Memory Low */
#define PSI5_RDM3_16_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005980u)

/** Alias (User Manual Name) for PSI5_RDM3_16_L.
* To use register names with standard convension, please use PSI5_RDM3_16_L.
*/
#define	PSI5_RDML316	(PSI5_RDM3_16_L)

/** \\brief  98C, Receive Data Memory High */
#define PSI5_RDM3_17_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000598Cu)

/** Alias (User Manual Name) for PSI5_RDM3_17_H.
* To use register names with standard convension, please use PSI5_RDM3_17_H.
*/
#define	PSI5_RDMH317	(PSI5_RDM3_17_H)

/** \\brief  988, Receive Data Memory Low */
#define PSI5_RDM3_17_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005988u)

/** Alias (User Manual Name) for PSI5_RDM3_17_L.
* To use register names with standard convension, please use PSI5_RDM3_17_L.
*/
#define	PSI5_RDML317	(PSI5_RDM3_17_L)

/** \\brief  994, Receive Data Memory High */
#define PSI5_RDM3_18_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005994u)

/** Alias (User Manual Name) for PSI5_RDM3_18_H.
* To use register names with standard convension, please use PSI5_RDM3_18_H.
*/
#define	PSI5_RDMH318	(PSI5_RDM3_18_H)

/** \\brief  990, Receive Data Memory Low */
#define PSI5_RDM3_18_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005990u)

/** Alias (User Manual Name) for PSI5_RDM3_18_L.
* To use register names with standard convension, please use PSI5_RDM3_18_L.
*/
#define	PSI5_RDML318	(PSI5_RDM3_18_L)

/** \\brief  99C, Receive Data Memory High */
#define PSI5_RDM3_19_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000599Cu)

/** Alias (User Manual Name) for PSI5_RDM3_19_H.
* To use register names with standard convension, please use PSI5_RDM3_19_H.
*/
#define	PSI5_RDMH319	(PSI5_RDM3_19_H)

/** \\brief  998, Receive Data Memory Low */
#define PSI5_RDM3_19_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005998u)

/** Alias (User Manual Name) for PSI5_RDM3_19_L.
* To use register names with standard convension, please use PSI5_RDM3_19_L.
*/
#define	PSI5_RDML319	(PSI5_RDM3_19_L)

/** \\brief  90C, Receive Data Memory High */
#define PSI5_RDM3_1_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000590Cu)

/** Alias (User Manual Name) for PSI5_RDM3_1_H.
* To use register names with standard convension, please use PSI5_RDM3_1_H.
*/
#define	PSI5_RDMH31	(PSI5_RDM3_1_H)

/** \\brief  908, Receive Data Memory Low */
#define PSI5_RDM3_1_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005908u)

/** Alias (User Manual Name) for PSI5_RDM3_1_L.
* To use register names with standard convension, please use PSI5_RDM3_1_L.
*/
#define	PSI5_RDML31	(PSI5_RDM3_1_L)

/** \\brief  9A4, Receive Data Memory High */
#define PSI5_RDM3_20_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059A4u)

/** Alias (User Manual Name) for PSI5_RDM3_20_H.
* To use register names with standard convension, please use PSI5_RDM3_20_H.
*/
#define	PSI5_RDMH320	(PSI5_RDM3_20_H)

/** \\brief  9A0, Receive Data Memory Low */
#define PSI5_RDM3_20_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059A0u)

/** Alias (User Manual Name) for PSI5_RDM3_20_L.
* To use register names with standard convension, please use PSI5_RDM3_20_L.
*/
#define	PSI5_RDML320	(PSI5_RDM3_20_L)

/** \\brief  9AC, Receive Data Memory High */
#define PSI5_RDM3_21_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059ACu)

/** Alias (User Manual Name) for PSI5_RDM3_21_H.
* To use register names with standard convension, please use PSI5_RDM3_21_H.
*/
#define	PSI5_RDMH321	(PSI5_RDM3_21_H)

/** \\brief  9A8, Receive Data Memory Low */
#define PSI5_RDM3_21_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059A8u)

/** Alias (User Manual Name) for PSI5_RDM3_21_L.
* To use register names with standard convension, please use PSI5_RDM3_21_L.
*/
#define	PSI5_RDML321	(PSI5_RDM3_21_L)

