keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  9B4, Receive Data Memory High */
#define PSI5_RDM3_22_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059B4u)

/** Alias (User Manual Name) for PSI5_RDM3_22_H.
* To use register names with standard convension, please use PSI5_RDM3_22_H.
*/
#define	PSI5_RDMH322	(PSI5_RDM3_22_H)

/** \\brief  9B0, Receive Data Memory Low */
#define PSI5_RDM3_22_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059B0u)

/** Alias (User Manual Name) for PSI5_RDM3_22_L.
* To use register names with standard convension, please use PSI5_RDM3_22_L.
*/
#define	PSI5_RDML322	(PSI5_RDM3_22_L)

/** \\brief  9BC, Receive Data Memory High */
#define PSI5_RDM3_23_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059BCu)

/** Alias (User Manual Name) for PSI5_RDM3_23_H.
* To use register names with standard convension, please use PSI5_RDM3_23_H.
*/
#define	PSI5_RDMH323	(PSI5_RDM3_23_H)

/** \\brief  9B8, Receive Data Memory Low */
#define PSI5_RDM3_23_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059B8u)

/** Alias (User Manual Name) for PSI5_RDM3_23_L.
* To use register names with standard convension, please use PSI5_RDM3_23_L.
*/
#define	PSI5_RDML323	(PSI5_RDM3_23_L)

/** \\brief  9C4, Receive Data Memory High */
#define PSI5_RDM3_24_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059C4u)

/** Alias (User Manual Name) for PSI5_RDM3_24_H.
* To use register names with standard convension, please use PSI5_RDM3_24_H.
*/
#define	PSI5_RDMH324	(PSI5_RDM3_24_H)

/** \\brief  9C0, Receive Data Memory Low */
#define PSI5_RDM3_24_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059C0u)

/** Alias (User Manual Name) for PSI5_RDM3_24_L.
* To use register names with standard convension, please use PSI5_RDM3_24_L.
*/
#define	PSI5_RDML324	(PSI5_RDM3_24_L)

/** \\brief  9CC, Receive Data Memory High */
#define PSI5_RDM3_25_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059CCu)

/** Alias (User Manual Name) for PSI5_RDM3_25_H.
* To use register names with standard convension, please use PSI5_RDM3_25_H.
*/
#define	PSI5_RDMH325	(PSI5_RDM3_25_H)

/** \\brief  9C8, Receive Data Memory Low */
#define PSI5_RDM3_25_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059C8u)

/** Alias (User Manual Name) for PSI5_RDM3_25_L.
* To use register names with standard convension, please use PSI5_RDM3_25_L.
*/
#define	PSI5_RDML325	(PSI5_RDM3_25_L)

/** \\brief  9D4, Receive Data Memory High */
#define PSI5_RDM3_26_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059D4u)

/** Alias (User Manual Name) for PSI5_RDM3_26_H.
* To use register names with standard convension, please use PSI5_RDM3_26_H.
*/
#define	PSI5_RDMH326	(PSI5_RDM3_26_H)

/** \\brief  9D0, Receive Data Memory Low */
#define PSI5_RDM3_26_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059D0u)

/** Alias (User Manual Name) for PSI5_RDM3_26_L.
* To use register names with standard convension, please use PSI5_RDM3_26_L.
*/
#define	PSI5_RDML326	(PSI5_RDM3_26_L)

/** \\brief  9DC, Receive Data Memory High */
#define PSI5_RDM3_27_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059DCu)

/** Alias (User Manual Name) for PSI5_RDM3_27_H.
* To use register names with standard convension, please use PSI5_RDM3_27_H.
*/
#define	PSI5_RDMH327	(PSI5_RDM3_27_H)

/** \\brief  9D8, Receive Data Memory Low */
#define PSI5_RDM3_27_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059D8u)

/** Alias (User Manual Name) for PSI5_RDM3_27_L.
* To use register names with standard convension, please use PSI5_RDM3_27_L.
*/
#define	PSI5_RDML327	(PSI5_RDM3_27_L)

/** \\brief  9E4, Receive Data Memory High */
#define PSI5_RDM3_28_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059E4u)

/** Alias (User Manual Name) for PSI5_RDM3_28_H.
* To use register names with standard convension, please use PSI5_RDM3_28_H.
*/
#define	PSI5_RDMH328	(PSI5_RDM3_28_H)

/** \\brief  9E0, Receive Data Memory Low */
#define PSI5_RDM3_28_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E0u)

/** Alias (User Manual Name) for PSI5_RDM3_28_L.
* To use register names with standard convension, please use PSI5_RDM3_28_L.
*/
#define	PSI5_RDML328	(PSI5_RDM3_28_L)

/** \\brief  9EC, Receive Data Memory High */
#define PSI5_RDM3_29_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059ECu)

/** Alias (User Manual Name) for PSI5_RDM3_29_H.
* To use register names with standard convension, please use PSI5_RDM3_29_H.
*/
#define	PSI5_RDMH329	(PSI5_RDM3_29_H)

/** \\brief  9E8, Receive Data Memory Low */
#define PSI5_RDM3_29_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059E8u)

/** Alias (User Manual Name) for PSI5_RDM3_29_L.
* To use register names with standard convension, please use PSI5_RDM3_29_L.
*/
#define	PSI5_RDML329	(PSI5_RDM3_29_L)

/** \\brief  914, Receive Data Memory High */
#define PSI5_RDM3_2_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005914u)

/** Alias (User Manual Name) for PSI5_RDM3_2_H.
* To use register names with standard convension, please use PSI5_RDM3_2_H.
*/
#define	PSI5_RDMH32	(PSI5_RDM3_2_H)

/** \\brief  910, Receive Data Memory Low */
#define PSI5_RDM3_2_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005910u)

/** Alias (User Manual Name) for PSI5_RDM3_2_L.
* To use register names with standard convension, please use PSI5_RDM3_2_L.
*/
#define	PSI5_RDML32	(PSI5_RDM3_2_L)

/** \\brief  9F4, Receive Data Memory High */
#define PSI5_RDM3_30_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059F4u)

/** Alias (User Manual Name) for PSI5_RDM3_30_H.
* To use register names with standard convension, please use PSI5_RDM3_30_H.
*/
#define	PSI5_RDMH330	(PSI5_RDM3_30_H)

/** \\brief  9F0, Receive Data Memory Low */
#define PSI5_RDM3_30_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F0u)

/** Alias (User Manual Name) for PSI5_RDM3_30_L.
* To use register names with standard convension, please use PSI5_RDM3_30_L.
*/
#define	PSI5_RDML330	(PSI5_RDM3_30_L)

/** \\brief  9FC, Receive Data Memory High */
#define PSI5_RDM3_31_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF00059FCu)

/** Alias (User Manual Name) for PSI5_RDM3_31_H.
* To use register names with standard convension, please use PSI5_RDM3_31_H.
*/
#define	PSI5_RDMH331	(PSI5_RDM3_31_H)

/** \\brief  9F8, Receive Data Memory Low */
#define PSI5_RDM3_31_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF00059F8u)

/** Alias (User Manual Name) for PSI5_RDM3_31_L.
* To use register names with standard convension, please use PSI5_RDM3_31_L.
*/
#define	PSI5_RDML331	(PSI5_RDM3_31_L)

/** \\brief  91C, Receive Data Memory High */
#define PSI5_RDM3_3_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000591Cu)

/** Alias (User Manual Name) for PSI5_RDM3_3_H.
* To use register names with standard convension, please use PSI5_RDM3_3_H.
*/
#define	PSI5_RDMH33	(PSI5_RDM3_3_H)

/** \\brief  918, Receive Data Memory Low */
#define PSI5_RDM3_3_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005918u)

/** Alias (User Manual Name) for PSI5_RDM3_3_L.
* To use register names with standard convension, please use PSI5_RDM3_3_L.
*/
#define	PSI5_RDML33	(PSI5_RDM3_3_L)

/** \\brief  924, Receive Data Memory High */
#define PSI5_RDM3_4_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005924u)

/** Alias (User Manual Name) for PSI5_RDM3_4_H.
* To use register names with standard convension, please use PSI5_RDM3_4_H.
*/
#define	PSI5_RDMH34	(PSI5_RDM3_4_H)

/** \\brief  920, Receive Data Memory Low */
#define PSI5_RDM3_4_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005920u)

/** Alias (User Manual Name) for PSI5_RDM3_4_L.
* To use register names with standard convension, please use PSI5_RDM3_4_L.
*/
#define	PSI5_RDML34	(PSI5_RDM3_4_L)

