keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  92C, Receive Data Memory High */
#define PSI5_RDM3_5_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000592Cu)

/** Alias (User Manual Name) for PSI5_RDM3_5_H.
* To use register names with standard convension, please use PSI5_RDM3_5_H.
*/
#define	PSI5_RDMH35	(PSI5_RDM3_5_H)

/** \\brief  928, Receive Data Memory Low */
#define PSI5_RDM3_5_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005928u)

/** Alias (User Manual Name) for PSI5_RDM3_5_L.
* To use register names with standard convension, please use PSI5_RDM3_5_L.
*/
#define	PSI5_RDML35	(PSI5_RDM3_5_L)

/** \\brief  934, Receive Data Memory High */
#define PSI5_RDM3_6_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005934u)

/** Alias (User Manual Name) for PSI5_RDM3_6_H.
* To use register names with standard convension, please use PSI5_RDM3_6_H.
*/
#define	PSI5_RDMH36	(PSI5_RDM3_6_H)

/** \\brief  930, Receive Data Memory Low */
#define PSI5_RDM3_6_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005930u)

/** Alias (User Manual Name) for PSI5_RDM3_6_L.
* To use register names with standard convension, please use PSI5_RDM3_6_L.
*/
#define	PSI5_RDML36	(PSI5_RDM3_6_L)

/** \\brief  93C, Receive Data Memory High */
#define PSI5_RDM3_7_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000593Cu)

/** Alias (User Manual Name) for PSI5_RDM3_7_H.
* To use register names with standard convension, please use PSI5_RDM3_7_H.
*/
#define	PSI5_RDMH37	(PSI5_RDM3_7_H)

/** \\brief  938, Receive Data Memory Low */
#define PSI5_RDM3_7_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005938u)

/** Alias (User Manual Name) for PSI5_RDM3_7_L.
* To use register names with standard convension, please use PSI5_RDM3_7_L.
*/
#define	PSI5_RDML37	(PSI5_RDM3_7_L)

/** \\brief  944, Receive Data Memory High */
#define PSI5_RDM3_8_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005944u)

/** Alias (User Manual Name) for PSI5_RDM3_8_H.
* To use register names with standard convension, please use PSI5_RDM3_8_H.
*/
#define	PSI5_RDMH38	(PSI5_RDM3_8_H)

/** \\brief  940, Receive Data Memory Low */
#define PSI5_RDM3_8_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005940u)

/** Alias (User Manual Name) for PSI5_RDM3_8_L.
* To use register names with standard convension, please use PSI5_RDM3_8_L.
*/
#define	PSI5_RDML38	(PSI5_RDM3_8_L)

/** \\brief  94C, Receive Data Memory High */
#define PSI5_RDM3_9_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF000594Cu)

/** Alias (User Manual Name) for PSI5_RDM3_9_H.
* To use register names with standard convension, please use PSI5_RDM3_9_H.
*/
#define	PSI5_RDMH39	(PSI5_RDM3_9_H)

/** \\brief  948, Receive Data Memory Low */
#define PSI5_RDM3_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005948u)

/** Alias (User Manual Name) for PSI5_RDM3_9_L.
* To use register names with standard convension, please use PSI5_RDM3_9_L.
*/
#define	PSI5_RDML39	(PSI5_RDM3_9_L)

/** \\brief  A04, Receive Data Memory High */
#define PSI5_RDM4_0_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A04u)

/** Alias (User Manual Name) for PSI5_RDM4_0_H.
* To use register names with standard convension, please use PSI5_RDM4_0_H.
*/
#define	PSI5_RDMH40	(PSI5_RDM4_0_H)

/** \\brief  A00, Receive Data Memory Low */
#define PSI5_RDM4_0_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A00u)

/** Alias (User Manual Name) for PSI5_RDM4_0_L.
* To use register names with standard convension, please use PSI5_RDM4_0_L.
*/
#define	PSI5_RDML40	(PSI5_RDM4_0_L)

/** \\brief  A54, Receive Data Memory High */
#define PSI5_RDM4_10_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A54u)

/** Alias (User Manual Name) for PSI5_RDM4_10_H.
* To use register names with standard convension, please use PSI5_RDM4_10_H.
*/
#define	PSI5_RDMH410	(PSI5_RDM4_10_H)

/** \\brief  A50, Receive Data Memory Low */
#define PSI5_RDM4_10_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A50u)

/** Alias (User Manual Name) for PSI5_RDM4_10_L.
* To use register names with standard convension, please use PSI5_RDM4_10_L.
*/
#define	PSI5_RDML410	(PSI5_RDM4_10_L)

/** \\brief  A5C, Receive Data Memory High */
#define PSI5_RDM4_11_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A5Cu)

/** Alias (User Manual Name) for PSI5_RDM4_11_H.
* To use register names with standard convension, please use PSI5_RDM4_11_H.
*/
#define	PSI5_RDMH411	(PSI5_RDM4_11_H)

/** \\brief  A58, Receive Data Memory Low */
#define PSI5_RDM4_11_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A58u)

/** Alias (User Manual Name) for PSI5_RDM4_11_L.
* To use register names with standard convension, please use PSI5_RDM4_11_L.
*/
#define	PSI5_RDML411	(PSI5_RDM4_11_L)

/** \\brief  A64, Receive Data Memory High */
#define PSI5_RDM4_12_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A64u)

/** Alias (User Manual Name) for PSI5_RDM4_12_H.
* To use register names with standard convension, please use PSI5_RDM4_12_H.
*/
#define	PSI5_RDMH412	(PSI5_RDM4_12_H)

/** \\brief  A60, Receive Data Memory Low */
#define PSI5_RDM4_12_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A60u)

/** Alias (User Manual Name) for PSI5_RDM4_12_L.
* To use register names with standard convension, please use PSI5_RDM4_12_L.
*/
#define	PSI5_RDML412	(PSI5_RDM4_12_L)

/** \\brief  A6C, Receive Data Memory High */
#define PSI5_RDM4_13_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A6Cu)

/** Alias (User Manual Name) for PSI5_RDM4_13_H.
* To use register names with standard convension, please use PSI5_RDM4_13_H.
*/
#define	PSI5_RDMH413	(PSI5_RDM4_13_H)

/** \\brief  A68, Receive Data Memory Low */
#define PSI5_RDM4_13_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A68u)

/** Alias (User Manual Name) for PSI5_RDM4_13_L.
* To use register names with standard convension, please use PSI5_RDM4_13_L.
*/
#define	PSI5_RDML413	(PSI5_RDM4_13_L)

/** \\brief  A74, Receive Data Memory High */
#define PSI5_RDM4_14_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A74u)

/** Alias (User Manual Name) for PSI5_RDM4_14_H.
* To use register names with standard convension, please use PSI5_RDM4_14_H.
*/
#define	PSI5_RDMH414	(PSI5_RDM4_14_H)

