keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  A70, Receive Data Memory Low */
#define PSI5_RDM4_14_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A70u)

/** Alias (User Manual Name) for PSI5_RDM4_14_L.
* To use register names with standard convension, please use PSI5_RDM4_14_L.
*/
#define	PSI5_RDML414	(PSI5_RDM4_14_L)

/** \\brief  A7C, Receive Data Memory High */
#define PSI5_RDM4_15_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A7Cu)

/** Alias (User Manual Name) for PSI5_RDM4_15_H.
* To use register names with standard convension, please use PSI5_RDM4_15_H.
*/
#define	PSI5_RDMH415	(PSI5_RDM4_15_H)

/** \\brief  A78, Receive Data Memory Low */
#define PSI5_RDM4_15_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A78u)

/** Alias (User Manual Name) for PSI5_RDM4_15_L.
* To use register names with standard convension, please use PSI5_RDM4_15_L.
*/
#define	PSI5_RDML415	(PSI5_RDM4_15_L)

/** \\brief  A84, Receive Data Memory High */
#define PSI5_RDM4_16_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A84u)

/** Alias (User Manual Name) for PSI5_RDM4_16_H.
* To use register names with standard convension, please use PSI5_RDM4_16_H.
*/
#define	PSI5_RDMH416	(PSI5_RDM4_16_H)

/** \\brief  A80, Receive Data Memory Low */
#define PSI5_RDM4_16_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A80u)

/** Alias (User Manual Name) for PSI5_RDM4_16_L.
* To use register names with standard convension, please use PSI5_RDM4_16_L.
*/
#define	PSI5_RDML416	(PSI5_RDM4_16_L)

/** \\brief  A8C, Receive Data Memory High */
#define PSI5_RDM4_17_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A8Cu)

/** Alias (User Manual Name) for PSI5_RDM4_17_H.
* To use register names with standard convension, please use PSI5_RDM4_17_H.
*/
#define	PSI5_RDMH417	(PSI5_RDM4_17_H)

/** \\brief  A88, Receive Data Memory Low */
#define PSI5_RDM4_17_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A88u)

/** Alias (User Manual Name) for PSI5_RDM4_17_L.
* To use register names with standard convension, please use PSI5_RDM4_17_L.
*/
#define	PSI5_RDML417	(PSI5_RDM4_17_L)

/** \\brief  A94, Receive Data Memory High */
#define PSI5_RDM4_18_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A94u)

/** Alias (User Manual Name) for PSI5_RDM4_18_H.
* To use register names with standard convension, please use PSI5_RDM4_18_H.
*/
#define	PSI5_RDMH418	(PSI5_RDM4_18_H)

/** \\brief  A90, Receive Data Memory Low */
#define PSI5_RDM4_18_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A90u)

/** Alias (User Manual Name) for PSI5_RDM4_18_L.
* To use register names with standard convension, please use PSI5_RDM4_18_L.
*/
#define	PSI5_RDML418	(PSI5_RDM4_18_L)

/** \\brief  A9C, Receive Data Memory High */
#define PSI5_RDM4_19_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A9Cu)

/** Alias (User Manual Name) for PSI5_RDM4_19_H.
* To use register names with standard convension, please use PSI5_RDM4_19_H.
*/
#define	PSI5_RDMH419	(PSI5_RDM4_19_H)

/** \\brief  A98, Receive Data Memory Low */
#define PSI5_RDM4_19_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A98u)

/** Alias (User Manual Name) for PSI5_RDM4_19_L.
* To use register names with standard convension, please use PSI5_RDM4_19_L.
*/
#define	PSI5_RDML419	(PSI5_RDM4_19_L)

/** \\brief  A0C, Receive Data Memory High */
#define PSI5_RDM4_1_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A0Cu)

/** Alias (User Manual Name) for PSI5_RDM4_1_H.
* To use register names with standard convension, please use PSI5_RDM4_1_H.
*/
#define	PSI5_RDMH41	(PSI5_RDM4_1_H)

/** \\brief  A08, Receive Data Memory Low */
#define PSI5_RDM4_1_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A08u)

/** Alias (User Manual Name) for PSI5_RDM4_1_L.
* To use register names with standard convension, please use PSI5_RDM4_1_L.
*/
#define	PSI5_RDML41	(PSI5_RDM4_1_L)

/** \\brief  AA4, Receive Data Memory High */
#define PSI5_RDM4_20_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AA4u)

/** Alias (User Manual Name) for PSI5_RDM4_20_H.
* To use register names with standard convension, please use PSI5_RDM4_20_H.
*/
#define	PSI5_RDMH420	(PSI5_RDM4_20_H)

/** \\brief  AA0, Receive Data Memory Low */
#define PSI5_RDM4_20_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AA0u)

/** Alias (User Manual Name) for PSI5_RDM4_20_L.
* To use register names with standard convension, please use PSI5_RDM4_20_L.
*/
#define	PSI5_RDML420	(PSI5_RDM4_20_L)

/** \\brief  AAC, Receive Data Memory High */
#define PSI5_RDM4_21_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AACu)

/** Alias (User Manual Name) for PSI5_RDM4_21_H.
* To use register names with standard convension, please use PSI5_RDM4_21_H.
*/
#define	PSI5_RDMH421	(PSI5_RDM4_21_H)

/** \\brief  AA8, Receive Data Memory Low */
#define PSI5_RDM4_21_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AA8u)

/** Alias (User Manual Name) for PSI5_RDM4_21_L.
* To use register names with standard convension, please use PSI5_RDM4_21_L.
*/
#define	PSI5_RDML421	(PSI5_RDM4_21_L)

/** \\brief  AB4, Receive Data Memory High */
#define PSI5_RDM4_22_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AB4u)

/** Alias (User Manual Name) for PSI5_RDM4_22_H.
* To use register names with standard convension, please use PSI5_RDM4_22_H.
*/
#define	PSI5_RDMH422	(PSI5_RDM4_22_H)

/** \\brief  AB0, Receive Data Memory Low */
#define PSI5_RDM4_22_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AB0u)

/** Alias (User Manual Name) for PSI5_RDM4_22_L.
* To use register names with standard convension, please use PSI5_RDM4_22_L.
*/
#define	PSI5_RDML422	(PSI5_RDM4_22_L)

/** \\brief  ABC, Receive Data Memory High */
#define PSI5_RDM4_23_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ABCu)

/** Alias (User Manual Name) for PSI5_RDM4_23_H.
* To use register names with standard convension, please use PSI5_RDM4_23_H.
*/
#define	PSI5_RDMH423	(PSI5_RDM4_23_H)

/** \\brief  AB8, Receive Data Memory Low */
#define PSI5_RDM4_23_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AB8u)

/** Alias (User Manual Name) for PSI5_RDM4_23_L.
* To use register names with standard convension, please use PSI5_RDM4_23_L.
*/
#define	PSI5_RDML423	(PSI5_RDM4_23_L)

/** \\brief  AC4, Receive Data Memory High */
#define PSI5_RDM4_24_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AC4u)

/** Alias (User Manual Name) for PSI5_RDM4_24_H.
* To use register names with standard convension, please use PSI5_RDM4_24_H.
*/
#define	PSI5_RDMH424	(PSI5_RDM4_24_H)

/** \\brief  AC0, Receive Data Memory Low */
#define PSI5_RDM4_24_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AC0u)

/** Alias (User Manual Name) for PSI5_RDM4_24_L.
* To use register names with standard convension, please use PSI5_RDM4_24_L.
*/
#define	PSI5_RDML424	(PSI5_RDM4_24_L)

/** \\brief  ACC, Receive Data Memory High */
#define PSI5_RDM4_25_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ACCu)

/** Alias (User Manual Name) for PSI5_RDM4_25_H.
* To use register names with standard convension, please use PSI5_RDM4_25_H.
*/
#define	PSI5_RDMH425	(PSI5_RDM4_25_H)

/** \\brief  AC8, Receive Data Memory Low */
#define PSI5_RDM4_25_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AC8u)

/** Alias (User Manual Name) for PSI5_RDM4_25_L.
* To use register names with standard convension, please use PSI5_RDM4_25_L.
*/
#define	PSI5_RDML425	(PSI5_RDM4_25_L)

/** \\brief  AD4, Receive Data Memory High */
#define PSI5_RDM4_26_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AD4u)

