keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** Alias (User Manual Name) for PSI5_RDM4_26_H.
* To use register names with standard convension, please use PSI5_RDM4_26_H.
*/
#define	PSI5_RDMH426	(PSI5_RDM4_26_H)

/** \\brief  AD0, Receive Data Memory Low */
#define PSI5_RDM4_26_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AD0u)

/** Alias (User Manual Name) for PSI5_RDM4_26_L.
* To use register names with standard convension, please use PSI5_RDM4_26_L.
*/
#define	PSI5_RDML426	(PSI5_RDM4_26_L)

/** \\brief  ADC, Receive Data Memory High */
#define PSI5_RDM4_27_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005ADCu)

/** Alias (User Manual Name) for PSI5_RDM4_27_H.
* To use register names with standard convension, please use PSI5_RDM4_27_H.
*/
#define	PSI5_RDMH427	(PSI5_RDM4_27_H)

/** \\brief  AD8, Receive Data Memory Low */
#define PSI5_RDM4_27_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AD8u)

/** Alias (User Manual Name) for PSI5_RDM4_27_L.
* To use register names with standard convension, please use PSI5_RDM4_27_L.
*/
#define	PSI5_RDML427	(PSI5_RDM4_27_L)

/** \\brief  AE4, Receive Data Memory High */
#define PSI5_RDM4_28_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AE4u)

/** Alias (User Manual Name) for PSI5_RDM4_28_H.
* To use register names with standard convension, please use PSI5_RDM4_28_H.
*/
#define	PSI5_RDMH428	(PSI5_RDM4_28_H)

/** \\brief  AE0, Receive Data Memory Low */
#define PSI5_RDM4_28_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AE0u)

/** Alias (User Manual Name) for PSI5_RDM4_28_L.
* To use register names with standard convension, please use PSI5_RDM4_28_L.
*/
#define	PSI5_RDML428	(PSI5_RDM4_28_L)

/** \\brief  AEC, Receive Data Memory High */
#define PSI5_RDM4_29_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AECu)

/** Alias (User Manual Name) for PSI5_RDM4_29_H.
* To use register names with standard convension, please use PSI5_RDM4_29_H.
*/
#define	PSI5_RDMH429	(PSI5_RDM4_29_H)

/** \\brief  AE8, Receive Data Memory Low */
#define PSI5_RDM4_29_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AE8u)

/** Alias (User Manual Name) for PSI5_RDM4_29_L.
* To use register names with standard convension, please use PSI5_RDM4_29_L.
*/
#define	PSI5_RDML429	(PSI5_RDM4_29_L)

/** \\brief  A14, Receive Data Memory High */
#define PSI5_RDM4_2_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A14u)

/** Alias (User Manual Name) for PSI5_RDM4_2_H.
* To use register names with standard convension, please use PSI5_RDM4_2_H.
*/
#define	PSI5_RDMH42	(PSI5_RDM4_2_H)

/** \\brief  A10, Receive Data Memory Low */
#define PSI5_RDM4_2_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A10u)

/** Alias (User Manual Name) for PSI5_RDM4_2_L.
* To use register names with standard convension, please use PSI5_RDM4_2_L.
*/
#define	PSI5_RDML42	(PSI5_RDM4_2_L)

/** \\brief  AF4, Receive Data Memory High */
#define PSI5_RDM4_30_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AF4u)

/** Alias (User Manual Name) for PSI5_RDM4_30_H.
* To use register names with standard convension, please use PSI5_RDM4_30_H.
*/
#define	PSI5_RDMH430	(PSI5_RDM4_30_H)

/** \\brief  AF0, Receive Data Memory Low */
#define PSI5_RDM4_30_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AF0u)

/** Alias (User Manual Name) for PSI5_RDM4_30_L.
* To use register names with standard convension, please use PSI5_RDM4_30_L.
*/
#define	PSI5_RDML430	(PSI5_RDM4_30_L)

/** \\brief  AFC, Receive Data Memory High */
#define PSI5_RDM4_31_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005AFCu)

/** Alias (User Manual Name) for PSI5_RDM4_31_H.
* To use register names with standard convension, please use PSI5_RDM4_31_H.
*/
#define	PSI5_RDMH431	(PSI5_RDM4_31_H)

/** \\brief  AF8, Receive Data Memory Low */
#define PSI5_RDM4_31_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005AF8u)

/** Alias (User Manual Name) for PSI5_RDM4_31_L.
* To use register names with standard convension, please use PSI5_RDM4_31_L.
*/
#define	PSI5_RDML431	(PSI5_RDM4_31_L)

/** \\brief  A1C, Receive Data Memory High */
#define PSI5_RDM4_3_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A1Cu)

/** Alias (User Manual Name) for PSI5_RDM4_3_H.
* To use register names with standard convension, please use PSI5_RDM4_3_H.
*/
#define	PSI5_RDMH43	(PSI5_RDM4_3_H)

/** \\brief  A18, Receive Data Memory Low */
#define PSI5_RDM4_3_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A18u)

/** Alias (User Manual Name) for PSI5_RDM4_3_L.
* To use register names with standard convension, please use PSI5_RDM4_3_L.
*/
#define	PSI5_RDML43	(PSI5_RDM4_3_L)

/** \\brief  A24, Receive Data Memory High */
#define PSI5_RDM4_4_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A24u)

/** Alias (User Manual Name) for PSI5_RDM4_4_H.
* To use register names with standard convension, please use PSI5_RDM4_4_H.
*/
#define	PSI5_RDMH44	(PSI5_RDM4_4_H)

/** \\brief  A20, Receive Data Memory Low */
#define PSI5_RDM4_4_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A20u)

/** Alias (User Manual Name) for PSI5_RDM4_4_L.
* To use register names with standard convension, please use PSI5_RDM4_4_L.
*/
#define	PSI5_RDML44	(PSI5_RDM4_4_L)

/** \\brief  A2C, Receive Data Memory High */
#define PSI5_RDM4_5_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A2Cu)

/** Alias (User Manual Name) for PSI5_RDM4_5_H.
* To use register names with standard convension, please use PSI5_RDM4_5_H.
*/
#define	PSI5_RDMH45	(PSI5_RDM4_5_H)

/** \\brief  A28, Receive Data Memory Low */
#define PSI5_RDM4_5_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A28u)

/** Alias (User Manual Name) for PSI5_RDM4_5_L.
* To use register names with standard convension, please use PSI5_RDM4_5_L.
*/
#define	PSI5_RDML45	(PSI5_RDM4_5_L)

/** \\brief  A34, Receive Data Memory High */
#define PSI5_RDM4_6_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A34u)

