keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** Alias (User Manual Name) for PSI5_RDM4_6_H.
* To use register names with standard convension, please use PSI5_RDM4_6_H.
*/
#define	PSI5_RDMH46	(PSI5_RDM4_6_H)

/** \\brief  A30, Receive Data Memory Low */
#define PSI5_RDM4_6_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A30u)

/** Alias (User Manual Name) for PSI5_RDM4_6_L.
* To use register names with standard convension, please use PSI5_RDM4_6_L.
*/
#define	PSI5_RDML46	(PSI5_RDM4_6_L)

/** \\brief  A3C, Receive Data Memory High */
#define PSI5_RDM4_7_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A3Cu)

/** Alias (User Manual Name) for PSI5_RDM4_7_H.
* To use register names with standard convension, please use PSI5_RDM4_7_H.
*/
#define	PSI5_RDMH47	(PSI5_RDM4_7_H)

/** \\brief  A38, Receive Data Memory Low */
#define PSI5_RDM4_7_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A38u)

/** Alias (User Manual Name) for PSI5_RDM4_7_L.
* To use register names with standard convension, please use PSI5_RDM4_7_L.
*/
#define	PSI5_RDML47	(PSI5_RDM4_7_L)

/** \\brief  A44, Receive Data Memory High */
#define PSI5_RDM4_8_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A44u)

/** Alias (User Manual Name) for PSI5_RDM4_8_H.
* To use register names with standard convension, please use PSI5_RDM4_8_H.
*/
#define	PSI5_RDMH48	(PSI5_RDM4_8_H)

/** \\brief  A40, Receive Data Memory Low */
#define PSI5_RDM4_8_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A40u)

/** Alias (User Manual Name) for PSI5_RDM4_8_L.
* To use register names with standard convension, please use PSI5_RDM4_8_L.
*/
#define	PSI5_RDML48	(PSI5_RDM4_8_L)

/** \\brief  A4C, Receive Data Memory High */
#define PSI5_RDM4_9_H /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_H*)0xF0005A4Cu)

/** Alias (User Manual Name) for PSI5_RDM4_9_H.
* To use register names with standard convension, please use PSI5_RDM4_9_H.
*/
#define	PSI5_RDMH49	(PSI5_RDM4_9_H)

/** \\brief  A48, Receive Data Memory Low */
#define PSI5_RDM4_9_L /*lint --e(923)*/ (*(volatile Ifx_PSI5_RDM_L*)0xF0005A48u)

/** Alias (User Manual Name) for PSI5_RDM4_9_L.
* To use register names with standard convension, please use PSI5_RDM4_9_L.
*/
#define	PSI5_RDML49	(PSI5_RDM4_9_L)

/** \\brief  3E4, Receive FIFO Control Register */
#define PSI5_RFC0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E4u)

/** \\brief  3E8, Receive FIFO Control Register */
#define PSI5_RFC1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E8u)

/** \\brief  3EC, Receive FIFO Control Register */
#define PSI5_RFC2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053ECu)

/** \\brief  3F0, Receive FIFO Control Register */
#define PSI5_RFC3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F0u)

/** \\brief  3F4, Receive FIFO Control Register */
#define PSI5_RFC4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F4u)

/** \\brief  560, RMIOV Clear Register */
#define PSI5_RMICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005560u)

/** \\brief  564, RMIOV Clear Register */
#define PSI5_RMICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005564u)

/** \\brief  568, RMIOV Clear Register */
#define PSI5_RMICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005568u)

/** \\brief  56C, RMIOV Clear Register */
#define PSI5_RMICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF000556Cu)

/** \\brief  570, RMIOV Clear Register */
#define PSI5_RMICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMICLR*)0xF0005570u)

/** \\brief  420, RMI Overview Register */
#define PSI5_RMIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005420u)

/** \\brief  424, RMI Overview Register */
#define PSI5_RMIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005424u)

/** \\brief  428, RMI Overview Register */
#define PSI5_RMIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005428u)

/** \\brief  42C, RMI Overview Register */
#define PSI5_RMIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF000542Cu)

/** \\brief  430, RMI Overview Register */
#define PSI5_RMIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005430u)

/** \\brief  4C0, RMIOV Set Register */
#define PSI5_RMISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C0u)

/** \\brief  4C4, RMIOV Set Register */
#define PSI5_RMISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C4u)

/** \\brief  4C8, RMIOV Set Register */
#define PSI5_RMISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C8u)

/** \\brief  4CC, RMIOV Set Register */
#define PSI5_RMISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054CCu)

/** \\brief  4D0, RMIOV Set Register */
#define PSI5_RMISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054D0u)

/** \\brief  54C, RSIOV Clear Register */
#define PSI5_RSICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000554Cu)

/** \\brief  550, RSIOV Clear Register */
#define PSI5_RSICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005550u)

/** \\brief  554, RSIOV Clear Register */
#define PSI5_RSICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005554u)

/** \\brief  558, RSIOV Clear Register */
#define PSI5_RSICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF0005558u)

/** \\brief  55C, RSIOV Clear Register */
#define PSI5_RSICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSICLR*)0xF000555Cu)

/** \\brief  40C, RSI Overview Register */
#define PSI5_RSIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000540Cu)

/** \\brief  410, RSI Overview Register */
#define PSI5_RSIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005410u)

/** \\brief  414, RSI Overview Register */
#define PSI5_RSIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005414u)

/** \\brief  418, RSI Overview Register */
#define PSI5_RSIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005418u)

/** \\brief  41C, RSI Overview Register */
#define PSI5_RSIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000541Cu)

/** \\brief  4AC, RSIOV Set Register */
#define PSI5_RSISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054ACu)

/** \\brief  4B0, RSIOV Set Register */
#define PSI5_RSISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B0u)

/** \\brief  4B4, RSIOV Set Register */
#define PSI5_RSISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B4u)

