keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPsi5_reg.h
/** \\brief  4B8, RSIOV Set Register */
#define PSI5_RSISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B8u)

/** \\brief  4BC, RSIOV Set Register */
#define PSI5_RSISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054BCu)

/** \\brief  588, TEIOV Clear Register */
#define PSI5_TEICLR0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005588u)

/** \\brief  58C, TEIOV Clear Register */
#define PSI5_TEICLR1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF000558Cu)

/** \\brief  590, TEIOV Clear Register */
#define PSI5_TEICLR2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005590u)

/** \\brief  594, TEIOV Clear Register */
#define PSI5_TEICLR3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005594u)

/** \\brief  598, TEIOV Clear Register */
#define PSI5_TEICLR4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEICLR*)0xF0005598u)

/** \\brief  448, TEI Overview Register */
#define PSI5_TEIOV0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005448u)

/** \\brief  44C, TEI Overview Register */
#define PSI5_TEIOV1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF000544Cu)

/** \\brief  450, TEI Overview Register */
#define PSI5_TEIOV2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005450u)

/** \\brief  454, TEI Overview Register */
#define PSI5_TEIOV3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005454u)

/** \\brief  458, TEI Overview Register */
#define PSI5_TEIOV4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005458u)

/** \\brief  4E8, TEIOV Set Register */
#define PSI5_TEISET0 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054E8u)

/** \\brief  4EC, TEIOV Set Register */
#define PSI5_TEISET1 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054ECu)

/** \\brief  4F0, TEIOV Set Register */
#define PSI5_TEISET2 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F0u)

/** \\brief  4F4, TEIOV Set Register */
#define PSI5_TEISET3 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F4u)

/** \\brief  4F8, TEIOV Set Register */
#define PSI5_TEISET4 /*lint --e(923)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F8u)

/** \\brief  1C, Time Stamp Register A */
#define PSI5_TSRA /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF000501Cu)

/** \\brief  20, Time Stamp Register B */
#define PSI5_TSRB /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005020u)

/** \\brief  24, Time Stamp Register C */
#define PSI5_TSRC /*lint --e(923)*/ (*(volatile Ifx_PSI5_TSR*)0xF0005024u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPSI5_REG_H */
